# 3. Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.
x = None
if x:
    print(True)
else:
    print(False)
# Так как None является ложным значением