#  Даны 2 действительных числа a и b. Получить их сумму, разность и
# произведение.

a = int(input("Введите число"))
b = int(input("Введите число"))
print(a + b, a - b, a * b)