# Даны два действительных числа. Найти среднее арифметическое и
# среднее геометрическое этих чисел.

#arithmetic
numbers = [5, 5]
average = sum(numbers) / len(numbers)
print(average)

import math
a = 5
b = 5
result = math.sqrt(a * b)
result2 = (a + b) / 2
