# Необходимо написать программу, которая требует у пользователя ввести
# два целых числа, строку и одно дробное число, далее выводит на экран
# строку и сумму двух целых и дробного числа.

a = int(input("Введите число"))
b = (input("Введите строку"))
c = float(input("Введите дробное число"))
print(a)
print(b)
print(c)